'''
Задача 0
В файле task_9_oop_1.py:
1. Создайте класс Input, принимающий 1 аргумент при инициализации (Loc)
2. Создайте объект search (экземпляр класса Input)
3. Выведите в консоль значение аргумента Loc, объекта search
'''

class Input:

    def __init__(self, loc):
        self.loc = loc


search = Input('input#search')

print(search.loc)


'''
Задача 1
1. Добавьте к классу Input атрибут объекта text
2. В этом же файле создайте:
- Класс Button
- Класс Title
- Класс Link
3. Для каждого класса пропишите артирубты text и loc
4. Создайте каждому из 4-х классов объекты, с любыми данными
5. Выведите в консоль text и loc каждого класса
'''

# TODO Решить задачу №1
